[
  {
    "_id": {
      "$oid": "65416434175cef0fc4243cfa"
    },
    "title": "Work Disability Management in the Paramedic Service Organizations: Disabilities Associated with OSI",
    "subject": "Work Disability Management ",
    "date": "September 19, 2022",
    "videoId": "5kaQPn701HI",
    "desc": "In this webinar, a focus is given towards prevention and the management of work disability related to operational stress injuries (OSI) and other mental health and well-being conditions of workers in the paramedic service organization. In this webinar, panelists discuss their experience and perspectives on managing disabilities associated with OSI."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243cfc"
    },
    "title": "Working in the Work-from-Home era: Navigating Work-life Balance",
    "subject": "Work from Home",
    "date": "January 17, 2022",
    "videoId": "oZ8_TBw4zNk",
    "desc": "In this webinar we will discuss the impacts that work-from-home (WFH) arrangements have on work-life balance of Canadian workers. The webinar will highlight important findings from a nation-wide WFH survey and follow-up study conducted by the Canadian Institute for Safety, Wellness, and Performance (CISWP) aimed at examining the impact the WFH arrangements have on Canadian’s health and wellbeing and will also outline key considerations for organizations with WFH employees."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243cfd"
    },
    "title": "Working in the Work-from-Home era: Understanding its Effect on Employee Mental Health",
    "subject": "Work from Home",
    "date": "October 25, 2021",
    "videoId": "JHGhGW6X7VY",
    "desc": "In this webinar we will discuss the impacts that work-from-home (WFH) arrangements have on mental health and stress. The webinar will highlight important findings from a nation-wide WFH survey and follow-up study conducted by the Canadian Institute for Safety, Wellness, and Performance (CISWP) aimed at examining the impact the WFH arrangements have on Canadian’s mental and physical wellbeing and will also outline key considerations for organizations with WFH employees.?"
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243cfe"
    },
    "title": "Working in the Work-from-Home era: Investigating Physical Health in the Home Office",
    "subject": "Work from Home",
    "date": "September 27, 2021",
    "videoId": "KTZunj7bt8c",
    "desc": "In this webinar, speakers will lead a discussion surrounding the impacts that work-from-home (WFH) has on pain and discomfort. The webinar will highlight important findings from a nation-wide WFH survey and follow-up study conducted by the Canadian Institute for Safety, Wellness, and Performance (CISWP) aimed at examining the impact that WFH arrangements has on mental and physical wellbeing. "
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243cff"
    },
    "title": "Ensuring Organizational Readiness and Resilience for Future Infectious Public Health Crises",
    "subject": "Healthcare",
    "date": "August 30, 2021",
    "videoId": "e5giPHZj410",
    "desc": "In this webinar, speakers will discuss strategies to support organizational readiness to protect and support the mental health of paramedics in future pandemics. This webinar explains how the guideline should be adopted by paramedic service organizations in order to lay the foundations for organizational resiliency and build an integrated management system to minimize the impacts of operational stress injuries and prepare for future infectious public health crises"
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d00"
    },
    "title": "Experiences from the frontlines of the COVID-19 pandemic",
    "subject": "Workforce Development",
    "date": "August 3, 2021",
    "videoId": "qqU56uFP8b8",
    "desc": "This webinar presents findings from a qualitative study conducted to inform to the development of the Guideline for Addressing Operational Stress Injuries during infectious public health crises. In this webinar, CISWP will present key informants’ perspectives and experiences on how the COVID-19 pandemic has changed the landscape of paramedic work, the unique stressors brought on at the onset of the pandemic, and the mitigation strategies that paramedic service organizations have implemented to support the mental health of their workforce."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d01"
    },
    "title": "Introducing the Guide for paramedic service organizations to address OSI during public health crises",
    "subject": "Workforce Development",
    "date": "August 16, 2021",
    "videoId": "CXYwI4nv_NU",
    "desc": "This webinar will present the new evidence-informed guideline for paramedic service organizations to address operational stress injuries during infectious public health crises. Speakers will discuss how to approach and integrate the guideline into existing organizational initiatives. In addition, the presenters will go over ten core elements of the guideline and provide pandemic-specific takeaways for addressing operational stress injuries."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d02"
    },
    "title": "Organizational strategies to address mental health during Infectious Public Health Crises",
    "subject": "Healthcare",
    "date": "July 19, 2021",
    "videoId": "w6xeu75cfoY",
    "desc": "In this webinar, CISWP researchers presented findings from a systematic review of the literature pertaining to the mental health of paramedics during infectious public health crises. They discussed how these findings were used to build upon CISWP’s previous research to develop the Guideline for Addressing Operational Stress Injuries (OSI) during Infectious Public Health Crises."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d03"
    },
    "title": "Working in the work-from-home era: Impacts on Personal & Organizational Productivity and Performance",
    "subject": "Work from Home",
    "date": "July 26, 2021",
    "videoId": "0zQ9TsDu0WU",
    "desc": "In this webinar, speakers presented the preliminary findings from a knowledge synthesis study, examining the impacts that work-from-home (WFH) arrangements have on personal and organizational performance and productivity. The review presented research evidence from 2010 – 2020 and includes research studies examining WFH arrangements across the globe and across industry sectors. This work is funded by the Social Sciences and Humanities Research Council (SSHRC) Knowledge Synthesis Grant program.?"
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d04"
    },
    "title": "Addressing Operational Stress Injuries among Canadian Paramedics",
    "subject": "Healthcare",
    "date": "May 10, 2021",
    "videoId": "7h43daGQr50",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d05"
    },
    "title": "Working in the Work-from-Home era: An Initial Glance at How Canadians are Doing",
    "subject": "Work from Home",
    "date": "June 28, 2021",
    "videoId": "d89Q25kWvv8",
    "desc": "In this webinar, we will discuss the initial key findings and their implications from a nationwide work-from-home (WFH) survey conducted by the Canadian Institute for Safety, Wellness, and Performance (CISWP). The study aimed to capture how WFH arrangements during the COVID-19 pandemic has impacted Canadian workers’ mental and physical wellbeing. Information from the survey will be used to help organizations develop suggestions and guidelines for supporting their WFH employees in the future."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d06"
    },
    "title": "Strategies and Tools to Estimate Physical Exposures in the Workplace",
    "subject": "Workforce Development",
    "date": "April 12, 2021",
    "videoId": "IwS2zIYD31A",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d07"
    },
    "title": "Work Disability Management System Standard (CSA Z1011:20): Labour Perspective",
    "subject": "Work Disability Management",
    "date": "March, 2021",
    "videoId": "gdisNMzVJCk",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d08"
    },
    "title": "Work Disability Management System Standard: Conversations on the Insurance Provider Perspective",
    "subject": "Work Disability Management",
    "date": "January 25, 2021",
    "videoId": "aSpAUJHxpzs",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d09"
    },
    "title": "Work Disability Management System Standard: The Role of Healthcare and Disability Management Service",
    "subject": "Work Disability Management",
    "date": "February 22, 2021",
    "videoId": "W1rRgjvk_80",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0a"
    },
    "title": "Fatigue in the Workplace: Why is it Important to Measure and How?",
    "subject": "Workforce Development",
    "date": "December 17, 2020",
    "videoId": "C3RGW-t73ig",
    "desc": "In a competitive economy, a core business priority within many organizations is optimal system performance. Production quality, in addition to innovativeness, is an important driver of overall profitability and organizational growth. We discuss the importance of worker fatigue, representing a mismatch between the technical system and human operator, resulting in deficits in work performance; as well as the potential link between fatigue and adverse health outcomes such as musculoskeletal disorders (MSD). We will discuss how fatigue can be measured in different types of work, providing examples during physical demanding work in construction and during a light precision task. We will also discuss the role of fatigue risk management to help mitigate the effects of fatigue."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0b"
    },
    "title": "Work Disability Management System Standard: Implications for Persons with Disabilities",
    "subject": "Work Disability Management",
    "date": "December 7, 2020",
    "videoId": "jSX5AqSbOrs",
    "desc": "?In this webinar, three panelists discuss the implications of CSA Z1011 for persons with disabilities."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0c"
    },
    "title": "Work Disability Management System Standard: Conversations on Employer Perspective",
    "subject": "Work Disability Management",
    "date": "December 9, 2020",
    "videoId": "bHRI0wUgQyM",
    "desc": "In this webinar, panelists discussed employers perspectives about the importance of CSA Z1011 standard in disability management."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0d"
    },
    "title": "Work Disability Management System Standard (CSA Z1011:20): Managing Mental Health in the Workplace",
    "date": "October 19, 2020",
    "videoId": "G2176BGF8yA",
    "desc": "The session is part of CISWP’s webinar series aimed at providing an opportunity for stakeholders across Canada to learn about the research conducted by CISWP scientists, partnering organizations and research collaborations.",
    "subject": "Healthcare"
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0e"
    },
    "title": "Whole-Body Vibration Exposure in Work: Acute Effects, Guidelines, and Risk Mitigation Strategies",
    "subject": "Healthcare",
    "date": "March, 2021",
    "videoId": "eaFlh8BmBAY",
    "desc": "In transportation and in construction, exposure to whole body vibration (WBV) is common in daily working life. Whole body vibrations, which are the shakes, bumps, and jolts that are transmitted from the vehicle to an occupant, can be problematic if the exposure is excessive. This webinar will: (1) examine the acute effects of WBV, (2) investigate whether established occupational guidelines protect the worker from injurious short-term effects, and (3) offer considerations to mitigate adverse WBV effects in work."
  },
  {
    "_id": {
      "$oid": "65416434175cef0fc4243d0f"
    },
    "title": "Formal Launch of Work Disability Management System Standard (CSA Z1011:20)",
    "subject": "Work Disability Management",
    "date": "January 25, 2021",
    "videoId": "HLlJd619IzE",
    "desc": "Hosted by Canadian Institute for Safety, Wellness, and Performance (CISWP), this webinar formally launches the new Canadian Standard to address work disability in the workplace."
  }
]